
```

```


```
/p03352.md
# p03352

## 题目描述

给定一个数X，求不大于X的最大的2的整数次幂。

## 输入格式

一个整数X

## 输出格式

一个整数，即不大于X的最大的2的整数次幂。

## 样例

### 样例输入

```
10
```

### 样例输出

```
8
```

## 数据范围与提示

```

```

## 题解

```/p03352.py
# -*- coding: utf-8 -*-

import sys

def main():
    X = int(sys.stdin.readline())
    num = [1, 4, 8, 16, 32, 64, 128, 256, 512,  9, 27, 81, 243, 729,  16, 64, 256, 1024, 25, 125, 625,  36, 216,  49, 343,  64, 512,  81, 729,  100, 1000, 121,  144,  169,  196,  225,  256,  289,  324,  361,  400, 441, 484,  529,  576,  625,  676,  729,  784,  841, 900,  961]
    num.sort()
    max = -1
    for i in range(len(num) - 1, -1, -1):
        n = num[i]
        if n <= X:
            max = max(max, n)
            break
    print(max)

if __name__ == '__main__':
    main()

