
```
import sys

str1 = sys.stdin.readline()
s = str1.split(" ")
i1 = int(s[0])
i2 = int(s[1])

count = i1 / i2
count += i1 % i2
print(count)
```

## 3.1.2.2. 1000번

### 3.1.2.2.1. 문제

두 정수 A와 B를 입력받은 다음, A+B를 출력하는 프로그램을 작성하시오.

### 3.1.2.2.2. 입력

첫째 줄에 테스트 케이스의 개수 T가 주어진다.

각 테스트 케이스는 한 줄로 이루어져 있으며, 각 줄에 A와 B가 주어진다. (0 < A, B < 10)

### 3.1.2.2.3. 출력

각 테스트 케이스마다 "Case #x: A + B = C" 형식으로 출력한다. x는 테스트 케이스 번호이고 1부터 시작하며, C는 A+B이다.

### 3.1.2.2.4. 예제 입력 1

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.5. 예제 출력 1

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.6. 예제 입력 2

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.7. 예제 출력 2

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.8. 예제 입력 3

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.9. 예제 출력 3

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.10. 예제 입력 4

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.11. 예제 출력 4

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.12. 예제 입력 5

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.13. 예제 출력 5

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.14. 예제 입력 6

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.15. 예제 출력 6

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.16. 예제 입력 7

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.17. 예제 출력 7

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.18. 예제 입력 8

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.19. 예제 출력 8

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.20. 예제 입력 9

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.21. 예제 출력 9

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.22. 예제 입력 10

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.23. 예제 출력 10

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.24. 예제 입력 11

```
5
1 1
2 3
3 4
9 8
5 2
```

### 3.1.2.2.25. 예제 출력 11

```
Case #1: 1 + 1 = 2
Case #2: 2 + 3 = 5
Case #3: 3 + 4 = 7
Case #4: 9 + 8 = 17
Case #5: 5 + 2 = 7
```

### 3.1.2.2.26. 예제 입력 12

```
5
1 1
2 3
3 4
9 8
5 2
```

