
```
n = int(input())
s = input()

p = 2019

# d'[i]: 右からi番目の文字の値 * 10^i (mod 2019)
# ex. 1817181712114
# d'[0]: 4 % 2019 -> 4
# d'[1]: 10 % 2019 -> 10
# d'[5]: 700000 (mod 2019) -> ?
# 7 * 10 * 10^4
# 7 * 19240
# 7 * 1069 = 7483 % 2019 = 1426

# d[i]: d'[i]の累積和
# d = {4,14,114,95}
d = [0] * (n+1)
ten = 1

# d[i]を計算する
# (右からi番目の文字(c[n-1])から左に向かって見ていく)
for i in range(n-1, -1, -1):
    # 1000000 % 2019は計算できるので
    a = ((ord(s[i]) - ord('0')) * ten) % p
    d[i] = (d[i+1] + a) % p
    ten = (ten * 10) % p

# 「d[i] = d[j]」とは、
# 「ex. 181712114 % 2019 = 2114 % 2019」
# 181710000 ≡ 0 (mod 2019)
# (gcd(2019, 10) = 1)
# 18171 ≡ 0 (mod 2019)
# 18171 % 2019 = 0
# 18171は2019の倍数

# map: d[]の値の個数
map = {}
for i in range(n+1):
    key = d[i]
    if key not
