

```python

```

## 00980. 01串

### 题目描述

给定一个长度为n的01串，求该串的最长连续子串中0和1的个数相同的子串的个数。

### 输入格式

第一行一个整数n，表示01串的长度。

第二行一个长度为n的01串。

### 输出格式

一个整数，表示答案。

### 数据范围

1≤n≤100000

### 输入样例：

```
5
01010
```

### 输出样例：

```
6
```

### 题解

```python

```

## 00981. 最长连续不重复子序列

### 题目描述

给定一个长度为n的整数序列，请找出最长的不包含重复的数的连续区间，输出它的长度。

### 输入格式

第一行包含整数n。

第二行包含n个整数（均在0~100000范围内），表示整数序列。

### 输出格式

共一行，包含一个整数，表示最长的不包含重复的数的连续区间的长度。

### 数据范围

1≤n≤100000

### 输入样例：

```
5
1 2 2 3 5
```

### 输出样例：

```
3
```

### 题解

```python

```

## 00982. 最长连续上升子序列

### 题目描述

给定一个长度为n的整数序列，请找出最长的不下降子序列的长度。

### 输入格式

第一行包含整数n。

第二行包含n个整数（均在0~100000范围内），表示整数序列。

### 输出格式

共一行，包含一个整数，表示最长的不下降子序列的长度。

### 数据范围

1≤n≤100000

### 输入样例：

```
5
1 2 2 3 5
```

### 输出样例：

```
3
```

### 题解

```python

```

## 00983. 最长公共上升子序列

### 题目描述

给定两个长度分别为n和m的整数序列A和B，请找出A和B的最长公共连续子序列中的长度。

### 输入格式

第一行包含两个整数n和m。

第二行包含n个整数，表示整数序列A。

第三行包含m个整数，表示整数序列B。

### 输出格式

共一行，包含一个整数，表示最长公共连续子序列的长度。

### 数据范围

1≤n,m≤1000

### 输入样例：

```
5 6
1 3 5 7 9
2 3 5 7 11 15
```

### 输出样例：

```
3
```

### 题解

```python

```

## 00984. 最长公共子序列

### 题目描述

给定两个长度分别为n和m的字符串A和B，请问A和B的最长公共子序列长度是多少。

### 输入格式

第一行包含两个整数n和m。

第二行包含一个长度为n的字符串，表示字符串A。

第三行包含一个长度为m的字符串，表示字符串B。

字符串均由小写字母构成。

### 输出格式

共一行，包含一个整数，表示最长公共子序列的长度。

### 数据范围

1≤n,m≤1000

### 输入样例：

```
5 6
abcbda
abcbbca
```

### 输出样例：

```
4
```

### 题解

```python

```

## 00985. 最长回文子序列

### 题目描述

给定一个长度为n的字符串，请问最长的回文子序列的长度是多少。

### 输入格式

第一行包含一个整数n。

第二行包含一个长度为n的字符串，字符串中只包含小写字母。

### 输出格式

共一行，包含一个整数，表示最长回文子序列的长度。

### 数据范围

1≤n≤5000

### 输入样例：

```
5
abcba
```

### 输出样例：

```
5
```

### 题解

```python

```

## 00986. 最长回文子串

### 题目描述

给定一个长度为n的字符串，请问最长的回文子串的长度是多少。

### 输入格式

第一行包含一个整数n。

第二行包含一个长度为n的字符串，字符串中只包含小写字母。

### 输出格式

共一行，包含一个整数，表示最长回文子串的长度。

### 数据范围

1≤n≤5000

### 输入样例：

```
5
abcba
```

### 输出样例：

```
5
```

### 题解

```python

```

## 00987. 最长回文子串

### 题目描述

给定一个长度为n的字符串，请问最长的回文子串的长度是多少。

### 输入格式

第一行包含一个整数n。

第二行包含一个长度为n的字符串，字符串中只包含小写字母。

### 输出格式

共一行，包含一个整数，表示最长回文子串的长度。

### 数据范围

1≤n≤5000

### 输入样例：

```
5
abcba
```

### 输出样例：

```
5
```

### 题解

```python

```

## 009
