

```
import sys

def calc(n, st):
    ans = 1
    val = st
    while val < n:
        val *= 2
        ans *= 2
    return ans

def main():
    N, K = map(int, sys.stdin.readline().split())
    ans = 0
    for i in range(1, N+1):
        cnt = calc(K, i)
        wk = 1.0 / (cnt * N)
        ans += wk
    print(ans)

if __name__ == '__main__':
    main()
```

## 03044

### 問題文

```
```

### 解答

```
```

## 03045

### 問題文

```
```

### 解答

```
```

## 03046

### 問題文

```
```

### 解答

```
```

## 03047

### 問題文

```
```

### 解答

```
```

## 03048

### 問題文

```
```

### 解答

```
```

## 03049

### 問題文

```
```

### 解答

```
```

## 03050

### 問題文

```
```

### 解答

```
```

## 03051

### 問題文

```
```

### 解答

```
```

## 03052

### 問題文

```
```

### 解答

```
```

## 03053

### 
