

```

import sys

def solve():
    k = int(input())
    if k == 1:
        print(1)
        print(1)
        return
    n = (k + 3) // 4 * 2
    ret = [[0 for i in range(n)] for j in range(n)]
    for i in range(n):
        for j in range(n):
            ret[i][j] = (i % 2 == 0 and 0 or n) + (i + j) % n
    for i in range(n):
        for j in range(n):
            if ret[i][j] >= k:
                ret[i][j] = (ret[i][j] - n) % k
    print(n)
    for i in range(n):
        for j in range(n):
            print(ret[i][j] + 1, end=' ')
        print()

if __name__ == '__main__':
    solve()

```

## p03189

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03190

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03191

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03192

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03193

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03194

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03195

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03196

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03197

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03198

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03199

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03200

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03201

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03202

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03203

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03204

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03205

### 题目

```

```

### 题解

```

```

### 代码

```

```

## p03206

### 题目

```

```

### 题解

```

```

### 代码

```

```

